# import geopandas as gpd
# import geodatasets
# import matplotlib.pyplot as plt
#
# # Load the built-in world dataset
# world = gpd.read_file(geodatasets.get_path("naturalearth.land"))
#
# world = world[world["name"] == "Russia"]
# # Plot the map
# world.plot()
# plt.title("Static World Map")
# plt.show()



# import math
#
# import plotly.express as px
# import pandas as pd
#
# home_country_data =[{'name': 'Австралия', 'count': 4}, {'name': 'Австрия', 'count': 31}, {'name': 'Азербайджан', 'count': 406}, {'name': 'Албания', 'count': 6}, {'name': 'Алжир', 'count': 19}, {'name': 'Ангола', 'count': 7}, {'name': 'Армения', 'count': 128}, {'name': 'Бахрейн', 'count': 1}, {'name': 'Белоруссия', 'count': 924}, {'name': 'Бельгия', 'count': 17}, {'name': 'Болгария', 'count': 41}, {'name': 'Босния и Герцеговина', 'count': 9}, {'name': 'Бразилия', 'count': 1}, {'name': 'Великобритания', 'count': 68}, {'name': 'Венгрия', 'count': 25}, {'name': 'Вьетнам', 'count': 4}, {'name': 'Гана', 'count': 5}, {'name': 'Гватемала', 'count': 2}, {'name': 'Гвинея', 'count': 3}, {'name': 'Германия', 'count': 337}, {'name': 'Гонконг', 'count': 3}, {'name': 'Греция', 'count': 21}, {'name': 'Грузия', 'count': 93}, {'name': 'Дания', 'count': 13}, {'name': 'Египет', 'count': 242}, {'name': 'Израиль', 'count': 210}, {'name': 'Индия', 'count': 10}, {'name': 'Индонезия', 'count': 37}, {'name': 'Иордания', 'count': 8}, {'name': 'Ирак', 'count': 62}, {'name': 'Иран', 'count': 5}, {'name': 'Ирландия', 'count': 10}, {'name': 'Исландия', 'count': 1}, {'name': 'Испания', 'count': 124}, {'name': 'Италия', 'count': 94}, {'name': 'Казахстан', 'count': 230}, {'name': 'Камерун', 'count': 1}, {'name': 'Канада', 'count': 2}, {'name': 'Катар', 'count': 11}, {'name': 'Кипр', 'count': 60}, {'name': 'Киргизия', 'count': 134}, {'name': 'Китай\xa0(Китайская Народная Республика)', 'count': 342}, {'name': 'Китайская Республика', 'count': 2}, {'name': 'Колумбия', 'count': 3}, {'name': 'Кот-д’Ивуар', 'count': 1}, {'name': 'Кувейт', 'count': 1}, {'name': 'Латвия', 'count': 75}, {'name': 'Ливан', 'count': 7}, {'name': 'Литва', 'count': 67}, {'name': 'Люксембург', 'count': 5}, {'name': 'Маврикий', 'count': 2}, {'name': 'Малайзия', 'count': 17}, {'name': 'Мальта', 'count': 2}, {'name': 'Марокко', 'count': 16}, {'name': 'Мексика', 'count': 4}, {'name': 'Молдавия', 'count': 53}, {'name': 'Монголия', 'count': 3}, {'name': 'Мьянма', 'count': 2}, {'name': 'Нигерия', 'count': 9}, {'name': 'Нидерланды', 'count': 13}, {'name': 'Норвегия', 'count': 14}, {'name': 'ОАЭ', 'count': 194}, {'name': 'Оман', 'count': 4}, {'name': 'Пакистан', 'count': 1}, {'name': 'Польша', 'count': 82}, {'name': 'Португалия', 'count': 7}, {'name': 'Республика Корея', 'count': 29}, {'name': 'Россия', 'count': 1071943}, {'name': 'Румыния', 'count': 7}, {'name': 'Саудовская Аравия', 'count': 15}, {'name': 'Северная Македония', 'count': 3}, {'name': 'Сейшельские Острова', 'count': 1}, {'name': 'Сенегал', 'count': 1}, {'name': 'Сербия', 'count': 133}, {'name': 'Сингапур', 'count': 4}, {'name': 'Сирия', 'count': 8}, {'name': 'Словакия', 'count': 13}, {'name': 'Словения', 'count': 7}, {'name': 'Судан', 'count': 3}, {'name': 'США', 'count': 138}, {'name': 'Таджикистан', 'count': 381}, {'name': 'Таиланд', 'count': 40}, {'name': 'Танзания', 'count': 3}, {'name': 'Тунис', 'count': 1}, {'name': 'Туркмения', 'count': 1}, {'name': 'Турция', 'count': 614}, {'name': 'Уганда', 'count': 3}, {'name': 'Узбекистан', 'count': 681}, {'name': 'Украина', 'count': 170}, {'name': 'Уругвай', 'count': 1}, {'name': 'Фиджи', 'count': 1}, {'name': 'Филиппины', 'count': 2}, {'name': 'Финляндия', 'count': 41}, {'name': 'Франция', 'count': 97}, {'name': 'Хорватия', 'count': 10}, {'name': 'Чад', 'count': 2}, {'name': 'Черногория', 'count': 20}, {'name': 'Чехия', 'count': 72}, {'name': 'Чили', 'count': 2}, {'name': 'Швейцария', 'count': 27}, {'name': 'Швеция', 'count': 33}, {'name': 'Шри-Ланка', 'count': 30}, {'name': 'Эквадор', 'count': 2}, {'name': 'Эстония', 'count': 290}, {'name': 'ЮАР', 'count': 8}, {'name': 'Япония', 'count': 5}]
# df = {"name": [i["name"] for i in home_country_data], "count": [i["count"] for i in home_country_data]}
#
# # Для карты нужны координаты (добавьте их в таблицу region)
# # координаты центров регионов
# df['lat'] = [-25.2744, 47.5162, 40.1431, 41.1533, 28.0339, -11.2027, 40.0691, 26.0667, 53.7098, 50.5039, 42.7339, 43.9159, -14.235, 55.3781, 47.1625, 21.2802, 7.9465, 15.7835, 9.9459, 51.1657, 22.3964, 39.0742, 42.3154, 56.2639, 26.8206, 31.0461, 20.5937, -0.7893, 31.2156, 33.2232, 32.4279, 53.4129, 64.9631, 40.4637, 41.8719, 48.0196, 7.3699, 56.1304, 25.3548, 35.1264, 41.2044, 35.8617, 23.6978, 4.5709, 7.54, 29.3117, 56.8796, 33.8547, 55.1694, 49.8153, -20.3484, 4.2105, 35.9375, 31.7917, 23.6345, 46.8625, 46.8625, 21.9162, 9.082, 52.1326, 60.472, 23.4241, 21.4733, 30.3753, 51.9194, 39.3999, 35.9078, 61.524, 45.9432, 23.8859, 41.6086, -4.6796, 14.4974, 44.0165, 1.3521, 34.8021, 48.669, 46.1512, 12.8628, 37.0902, 38.861, 15.87, -6.369, 33.8869, 38.9697, 38.9637, 1.3733, 41.3775, 48.3794, -32.5228, -17.7134, 12.8797, 61.9241, 46.2276, 45.1, 15.4542, 42.7087, 49.8175, -35.6751, 46.8182, 60.1282, 7.8731, -1.8312, 58.5953, -30.5595, 36.2048]
#
# df['lon'] = [133.7751, 14.5501, 47.5769, 19.5046, 1.6596, 17.8739, 45.0382, 50.5577, 27.9534, 4.4699, 25.4858, 17.6791, -51.9253, -3.436, 19.5033, 105.8575, -1.0232, -85.3022, -9.9549, 10.4515, 114.1095, 21.8243, 43.3569, 9.5018, 30.8025, 34.8516, 78.9629, 113.9213, 36.0, 43.6793, 53.688, -7.9795, -19.0208, -3.7492, 12.5674, 66.0463, 12.3547, -106.3468, 51.1839, 33.4346, 74.7661, 104.1954, 110.7883, -74.2973, -5.5471, 47.4818, 24.6032, 35.8623, 23.8813, 6.1296, 57.5522, 101.9758, 14.3754, -7.0926, -102.5528, 27.4773, 103.8467, 95.956, 8.6753, 5.2913, 8.4689, 53.8478, 55.9755, 69.3451, 19.1451, -8.2245, 127.7669, 105.3188, 24.9668, 45.0792, 21.7453, 55.4919, -14.4524, 21.0059, 103.8198, 38.9968, 19.699, 14.9955, 30.2176, -95.7129, 71.2761, 100.9925, 34.8888, 9.5375, 59.5563, 35.2433, 32.2903, 64.5853, 31.1656, -55.7658, 178.065, 121.774, 25.7482, 2.2137, 15.2, 18.7322, 19.3744, 15.473, -71.543, 8.2275, 18.6435, 80.7718, -78.1834, 25.0136, 22.9375, 138.2529]
#
# df['log_count'] = [math.log10(i['count']) for i in home_country_data]
# df = pd.DataFrame(df)
#
# fig = px.scatter_mapbox(
#     df, lat='lat', lon='lon',
#     size='log_count', size_max=10,
#     hover_name='name',
#     hover_data={'Количество туристов': ':.0f', 'lat': False, 'lon': False, 'log_count': False},
#     mapbox_style='carto-positron',
#     zoom=1
# )
# fig.show()



coords = {
    'Ардатовский муниципальный район': (55.2414, 43.0969),
    'Арзамасский муниципальный район': (55.3833, 43.8000),
    'Балахнинский муниципальный район': (56.4808, 43.5403),
    'Богородский муниципальный район': (56.0997, 43.5072),
    'Большеболдинский муниципальный район': (55.0056, 45.3092),
    'Большемурашкинский муниципальный район': (55.7808, 44.7708),
    'Бутурлинский муниципальный район': (55.5653, 44.9006),
    'Вадский муниципальный район': (55.5303, 44.2111),
    'Варнавинский муниципальный район': (57.4036, 45.0917),
    'Вачский муниципальный район': (55.8000, 42.7722),
    'Ветлужский муниципальный район': (57.8556, 45.7811),
    'Вознесенский муниципальный район': (54.8917, 42.7750),
    'Володарский муниципальный район': (56.2333, 43.2000),
    'Воротынский муниципальный район': (56.0500, 45.8500),
    'Воскресенский муниципальный район': (56.8333, 45.4333),
    'Гагинский муниципальный район': (55.2375, 45.0439),
    'город Арзамас': (55.3833, 43.8000),
    'город Бор': (56.3603, 44.0592),
    'город Выкса': (55.3194, 42.1731),
    'город Дзержинск': (56.2333, 43.4500),
    'город Кулебаки': (55.4167, 42.5167),
    'город Первомайск': (54.8667, 43.8000),
    'город Чкаловск': (56.7647, 43.2511),
    'город Шахунья': (57.6764, 46.6128),
    'Городецкий муниципальный район': (56.6503, 43.4703),
    'Дальнеконстантиновский муниципальный район': (55.8103, 44.1119),
    'Дивеевский муниципальный район': (55.0439, 43.2461),
    'ЗАТО город Саров': (54.9333, 43.3167),
    'Княгининский муниципальный район': (55.8167, 45.0333),
    'Ковернинский муниципальный район': (57.1253, 43.8142),
    'Краснобаковский муниципальный район': (57.1297, 45.1556),
    'Краснооктябрьский муниципальный район': (55.3231, 45.4308),
    'Кстовский муниципальный район': (56.1514, 44.1958),
    'Лукояновский муниципальный район': (55.0383, 44.4978),
    'Лысковский муниципальный район': (56.0128, 45.0253),
    'Навашинский': (55.5364, 42.1936),
    'Павловский муниципальный район': (55.9667, 43.0833),
    'Перевозский': (55.5964, 44.5458),
    'Пильнинский муниципальный район': (55.5561, 45.9208),
    'Починковский муниципальный район': (54.6964, 44.8611),
    'Семеновский': (56.7833, 44.4833),
    'Сергачский муниципальный район': (55.5311, 45.4656),
    'Сеченовский муниципальный район': (55.2206, 45.8906),
    'Сокольский': (57.1414, 43.1589),
    'Сосновский муниципальный район': (55.8025, 43.1653),
    'Спасский муниципальный район': (55.8569, 45.6942),
    'Тонкинский муниципальный район': (57.3717, 46.4639),
    'Тоншаевский муниципальный район': (57.7350, 47.0133),
    'Уренский муниципальный район': (57.4622, 45.7867),
    'Шарангский муниципальный район': (57.1711, 46.5461),
    'Шатковский муниципальный район': (55.1886, 44.1572),
}

lat = []
lon = []
for key in coords:
    lat.append(coords[key][0])
    lon.append(coords[key][1])
print(lat)
print(lon)